Revit 2027 API
CurtainGrid.GetCurtainCells Method
 Gets the CurtainCells owned by this curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<CurtainCell> GetCurtainCells()
Public Function GetCurtainCells As ICollection(Of CurtainCell)
public:
ICollection<CurtainCell^>^ GetCurtainCells()
member GetCurtainCells : unit -> ICollection<CurtainCell>
Return Value
ICollection<CurtainCell>
 The CurtainCells owned by this curtain grid.
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace